grevaillot/svd_tools/headers/STM32L4x3/rcc.h
/** @defgroup rcc_apb1smenr1 APB1SMENR1 APB1SMENR1
@{*/

/** RCC_APB1SMENR1_LPTIM1SMEN Low power timer 1 clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_LPTIM1SMEN		(1 << 31)
/** RCC_APB1SMENR1_OPAMPSMEN OPAMP interface clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_OPAMPSMEN		(1 << 30)
/** RCC_APB1SMENR1_DAC1SMEN DAC1 interface clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_DAC1SMEN		(1 << 29)
/** RCC_APB1SMENR1_PWRSMEN Power interface clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_PWRSMEN		(1 << 28)
/** RCC_APB1SMENR1_USBFSSMEN USB FS clock enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_USBFSSMEN		(1 << 26)
/** RCC_APB1SMENR1_CAN1SMEN CAN1 clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_CAN1SMEN		(1 << 25)
/** RCC_APB1SMENR1_I2C3SMEN I2C3 clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_I2C3SMEN		(1 << 23)
/** RCC_APB1SMENR1_I2C2SMEN I2C2 clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_I2C2SMEN		(1 << 22)
/** RCC_APB1SMENR1_I2C1SMEN I2C1 clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_I2C1SMEN		(1 << 21)
/** RCC_APB1SMENR1_USART3SMEN USART3 clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_USART3SMEN		(1 << 18)
/** RCC_APB1SMENR1_USART2SMEN USART2 clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_USART2SMEN		(1 << 17)
/** RCC_APB1SMENR1_SP3SMEN SPI3 clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_SP3SMEN		(1 << 15)
/** RCC_APB1SMENR1_SPI2SMEN SPI2 clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_SPI2SMEN		(1 << 14)
/** RCC_APB1SMENR1_WWDGSMEN Window watchdog clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_WWDGSMEN		(1 << 11)
/** RCC_APB1SMENR1_RTCAPBSMEN RTC APB clock enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_RTCAPBSMEN		(1 << 10)
/** RCC_APB1SMENR1_LCDSMEN LCD clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_LCDSMEN		(1 << 9)
/** RCC_APB1SMENR1_TIM7SMEN TIM7 timer clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_TIM7SMEN		(1 << 5)
/** RCC_APB1SMENR1_TIM6SMEN TIM6 timer clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_TIM6SMEN		(1 << 4)
/** RCC_APB1SMENR1_TIM2SMEN TIM2 timer clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_TIM2SMEN		(1 << 0)

/**@}*/

/** @defgroup rcc_apb1smenr2 APB1SMENR2 APB1 peripheral clocks enable in Sleep and Stop modes register 2
@{*/

/** RCC_APB1SMENR2_LPTIM2SMEN LPTIM2SMEN **/
#define RCC_APB1SMENR2_LPTIM2SMEN		(1 << 5)
/** RCC_APB1SMENR2_SWPMI1SMEN Single wire protocol clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR2_SWPMI1SMEN		(1 << 2)
/** RCC_APB1SMENR2_LPUART1SMEN Low power UART 1 clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR2_LPUART1SMEN		(1 << 0)

/**@}*/

/** @defgroup rcc_apb2smenr APB2SMENR APB2SMENR
@{*/

/** RCC_APB2SMENR_SAI1SMEN SAI1 clocks enable during Sleep and Stop modes **/
#define RCC_APB2SMENR_SAI1SMEN		(1 << 21)
/** RCC_APB2SMENR_TIM16SMEN TIM16 timer clocks enable during Sleep and Stop modes **/
#define RCC_APB2SMENR_TIM16SMEN		(1 << 17)
/** RCC_APB2SMENR_TIM15SMEN TIM15 timer clocks enable during Sleep and Stop modes **/
#define RCC_APB2SMENR_TIM15SMEN		(1 << 16)
/** RCC_APB2SMENR_USART1SMEN USART1clocks enable during Sleep and Stop modes **/
#define RCC_APB2SMENR_USART1SMEN		(1 << 14)
/** RCC_APB2SMENR_SPI1SMEN SPI1 clocks enable during Sleep and Stop modes **/
#define RCC_APB2SMENR_SPI1SMEN		(1 << 12)
/** RCC_APB2SMENR_TIM1SMEN TIM1 timer clocks enable during Sleep and Stop modes **/
#define RCC_APB2SMENR_TIM1SMEN		(1 << 11)
/** RCC_APB2SMENR_SDMMCSMEN SDMMC clocks enable during Sleep and Stop modes **/
#define RCC_APB2SMENR_SDMMCSMEN		(1 << 10)
/** RCC_APB2SMENR_SYSCFGSMEN SYSCFG clocks enable during Sleep and Stop modes **/
#define RCC_APB2SMENR_SYSCFGSMEN		(1 << 0)

/**@}*/

/** @defgroup rcc_ccipr CCIPR CCIPR
@{*/

/** RCC_CCIPR_SWPMI1SEL SWPMI1 clock source selection **/
#define RCC_CCIPR_SWPMI1SEL		(1 << 30)

#define RCC_CCIPR_ADCSEL_SHIFT		28
#define RCC_CCIPR_ADCSEL_MASK		0x03
/** @defgroup rcc_ccipr_adcsel ADCSEL ADCs clock source selection
@{*/
/**@}*/


#define RCC_CCIPR_CLK48SEL_SHIFT		26
#define RCC_CCIPR_CLK48SEL_MASK		0x03
/** @defgroup rcc_ccipr_clk48sel CLK48SEL 48 MHz clock source selection
@{*/
/**@}*/


#define RCC_CCIPR_SAI1SEL_SHIFT		22
#define RCC_CCIPR_SAI1SEL_MASK		0x03
/** @defgroup rcc_ccipr_sai1sel SAI1SEL SAI1 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR_LPTIM2SEL_SHIFT		20
#define RCC_CCIPR_LPTIM2SEL_MASK		0x03
/** @defgroup rcc_ccipr_lptim2sel LPTIM2SEL Low power timer 2 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR_LPTIM1SEL_SHIFT		18
#define RCC_CCIPR_LPTIM1SEL_MASK		0x03
/** @defgroup rcc_ccipr_lptim1sel LPTIM1SEL Low power timer 1 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR_I2C3SEL_SHIFT		16
#define RCC_CCIPR_I2C3SEL_MASK		0x03
/** @defgroup rcc_ccipr_i2c3sel I2C3SEL I2C3 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR_I2C2SEL_SHIFT		14
#define RCC_CCIPR_I2C2SEL_MASK		0x03
/** @defgroup rcc_ccipr_i2c2sel I2C2SEL I2C2 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR_I2C1SEL_SHIFT		12
#define RCC_CCIPR_I2C1SEL_MASK		0x03
/** @defgroup rcc_ccipr_i2c1sel I2C1SEL I2C1 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR_LPUART1SEL_SHIFT		10
#define RCC_CCIPR_LPUART1SEL_MASK		0x03
/** @defgroup rcc_ccipr_lpuart1sel LPUART1SEL LPUART1 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR_USART3SEL_SHIFT		4
#define RCC_CCIPR_USART3SEL_MASK		0x03
/** @defgroup rcc_ccipr_usart3sel USART3SEL USART3 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR_USART2SEL_SHIFT		2
#define RCC_CCIPR_USART2SEL_MASK		0x03
/** @defgroup rcc_ccipr_usart2sel USART2SEL USART2 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR_USART1SEL_SHIFT		0
#define RCC_CCIPR_USART1SEL_MASK		0x03
/** @defgroup rcc_ccipr_usart1sel USART1SEL USART1 clock source selection
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_bdcr BDCR BDCR
@{*/

/** RCC_BDCR_LSCOSEL Low speed clock output selection **/
#define RCC_BDCR_LSCOSEL		(1 << 25)
/** RCC_BDCR_LSCOEN Low speed clock output enable **/
#define RCC_BDCR_LSCOEN		(1 << 24)
/** RCC_BDCR_BDRST Backup domain software reset **/
#define RCC_BDCR_BDRST		(1 << 16)
/** RCC_BDCR_RTCEN RTC clock enable **/
#define RCC_BDCR_RTCEN		(1 << 15)

